In [25]:
import pandas as pd
import re
import matplotlib.pyplot as plt
#from mpl_toolkits.basemap import Basemap
%matplotlib inline

In [26]:
measure = 'Resources/hawaii_measurements.csv'
station = 'Resources/hawaii_stations.csv'

In [27]:
df_measure = pd.read_csv(measure)
df_station = pd.read_csv(station)

In [28]:
df_measure.head()

       station        date  prcp  tobs
0  USC00519397  2010-01-01  0.08    65
1  USC00519397  2010-01-02  0.00    63
2  USC00519397  2010-01-03  0.00    74
3  USC00519397  2010-01-04  0.00    76
4  USC00519397  2010-01-06   NaN    73

In [29]:
df_measure.shape

(19550, 4)

In [30]:
df_station

,station,name,latitude,longitude,elevation
0,USC00519397,"WAIKIKI 717.2, HI US",21.27160,-157.81680,3.0
1,USC00513117,"KANEOHE 838.1, HI US",21.42340,-157.80150,14.6
2,USC00514830,"KUALOA RANCH HEADQUARTERS 886.9, HI US",21.52130,-157.83740,7.0
3,USC00517948,"PEARL CITY, HI US",21.39340,-157.97510,11.9
4,USC00518838,"UPPER WAHIAWA 874.3, HI US",21.49920,-158.01110,306.6
5,USC00519523,"WAIMANALO EXPERIMENTAL FARM, HI US",21.33556,-157.71139,19.5
6,USC00519281,"WAIHEE 837.5, HI US",21.45167,-157.84889,32.9
7,USC00511918,"HONOLULU OBSERVATORY 702.2, HI US",21.31520,-157.99920,0.9
8,USC00516128,"MANOA LYON ARBO 785.2, HI US",21.33310,-157.80250,152.4

In [31]:
df_station.shape

(9, 5)

In [32]:
df = pd.merge(df_station, df_measure, on = 'station', how='inner')
df.head()

,station,name,latitude,longitude,elevation,date,prcp,tobs
0,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0,2010-01-01,0.08,65
1,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0,2010-01-02,0.00,63
2,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0,2010-01-03,0.00,74
3,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0,2010-01-04,0.00,76
4,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0,2010-01-06,NaN,73

In [33]:
df.shape

(19550, 8)

In [34]:
df['month'] = ''
df['day'] = ''
df['year'] = ''

In [35]:
index_row_problem = []

for index, row in df.iterrows():
    try:
        df.set_value(index, 'month', re.split(r'[-]+', row["date"])[1])
        df.set_value(index, 'year', re.split(r'[-]+', row["date"])[0])
        df.set_value(index, 'day', re.split(r'[-]+', row["date"])[2])
    except:
        index_row_problem.append(row)
df.head()

,station,name,latitude,longitude,elevation,date,prcp,tobs,month,day,year
0,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0,2010-01-01,0.08,65,01,01,2010
1,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0,2010-01-02,0.00,63,01,02,2010
2,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0,2010-01-03,0.00,74,01,03,2010
3,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0,2010-01-04,0.00,76,01,04,2010
4,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0,2010-01-06,NaN,73,01,06,2010

In [36]:
df['date_format'] = pd.to_datetime(df['date'])
df.head()

,station,name,latitude,longitude,elevation,date,prcp,tobs,month,day,year,date_format
0,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0,2010-01-01,0.08,65,01,01,2010,2010-01-01
1,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0,2010-01-02,0.00,63,01,02,2010,2010-01-02
2,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0,2010-01-03,0.00,74,01,03,2010,2010-01-03
3,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0,2010-01-04,0.00,76,01,04,2010,2010-01-04
4,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0,2010-01-06,NaN,73,01,06,2010,2010-01-06

In [37]:
del df['date']

In [38]:
df.describe()

           latitude     longitude     elevation          prcp          tobs
count  19550.000000  19550.000000  19550.000000  18103.000000  19550.000000
mean      21.382151   -157.839901     39.858363      0.160644     73.097954
std        0.079017      0.085735     64.987876      0.468746      4.523527
min       21.271600   -158.011100      0.900000      0.000000     53.000000
25%       21.333100   -157.848890      7.000000      0.000000     70.000000
50%       21.335560   -157.816800     14.600000      0.010000     73.000000
75%       21.451670   -157.801500     32.900000      0.110000     76.000000
max       21.521300   -157.711390    306.600000     11.530000     87.000000

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 19550 entries, 0 to 19549
Data columns (total 11 columns):
station        19550 non-null object
name           19550 non-null object
latitude       19550 non-null float64
longitude      19550 non-null float64
elevation      19550 non-null float64
prcp           18103 non-null float64
tobs           19550 non-null int64
month          19550 non-null object
day            19550 non-null object
year           19550 non-null object
date_format    19550 non-null datetime64[ns]
dtypes: datetime64[ns](1), float64(4), int64(1), object(5)
memory usage: 2.4+ MB

In [40]:
df.head()

,station,name,latitude,longitude,elevation,prcp,tobs,month,day,year,date_format
0,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0,0.08,65,01,01,2010,2010-01-01
1,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0,0.00,63,01,02,2010,2010-01-02
2,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0,0.00,74,01,03,2010,2010-01-03
3,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0,0.00,76,01,04,2010,2010-01-04
4,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0,NaN,73,01,06,2010,2010-01-06

In [41]:
unique_names_city = []
all_list = df['name'].tolist()
for each in all_list:
    if each not in unique_names_city:
        unique_names_city.append(each)
unique_names_city

['WAIKIKI 717.2, HI US',
 'KANEOHE 838.1, HI US',
 'KUALOA RANCH HEADQUARTERS 886.9, HI US',
 'PEARL CITY, HI US',
 'UPPER WAHIAWA 874.3, HI US',
 'WAIMANALO EXPERIMENTAL FARM, HI US',
 'WAIHEE 837.5, HI US',
 'HONOLULU OBSERVATORY 702.2, HI US',
 'MANOA LYON ARBO 785.2, HI US']

In [42]:
unique_months = []
all_list_mo = df['month'].tolist()
for each in all_list_mo:
    if each not in unique_months:
        unique_months.append(each)
unique_months

['01', '02', '03', '04', '05', '06', '07', '08', '09', '10', '11', '12']

In [43]:
mean_ =  df[(df['name'] == 'WAIKIKI 717.2, HI US') & (df['month'] == '01')]['prcp'].mean()
mean_

0.040085836909871206

In [44]:
df[(df['name'] == 'WAIKIKI 717.2, HI US') & (df['month'] == '02')]['prcp'].mean()

0.0673611111111111

In [45]:
df.loc[(df['prcp'].isnull()) & (df['name'] == 'WAIKIKI 717.2, HI US') & (df['month'] == '01'), 'prcp']

4      NaN
26     NaN
341    NaN
1045   NaN
1046   NaN
1410   NaN
1411   NaN
Name: prcp, dtype: float64

In [46]:
def fill_mean(dataset):
    
    for each_city in unique_names_city:

        for each_month in unique_months:

            ds = dataset[dataset['name'] == each_city]
            ds = ds[ds['month'] == each_month]
            
            mean_prcp = ds['prcp'].mean()
            
            dataset.loc[(dataset['prcp'].isnull()) &
                   (dataset['name'] == each_city) &
                   (dataset['month'] == each_month), 
                   'prcp'] = mean_prcp

In [47]:
fill_mean(df)

In [48]:
df.head()

,station,name,latitude,longitude,elevation,prcp,tobs,month,day,year,date_format
0,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0,0.080000,65,01,01,2010,2010-01-01
1,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0,0.000000,63,01,02,2010,2010-01-02
2,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0,0.000000,74,01,03,2010,2010-01-03
3,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0,0.000000,76,01,04,2010,2010-01-04
4,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0,0.040086,73,01,06,2010,2010-01-06

In [49]:
df.describe()

           latitude     longitude     elevation          prcp          tobs
count  19550.000000  19550.000000  19550.000000  19550.000000  19550.000000
mean      21.382151   -157.839901     39.858363      0.158283     73.097954
std        0.079017      0.085735     64.987876      0.452465      4.523527
min       21.271600   -158.011100      0.900000      0.000000     53.000000
25%       21.333100   -157.848890      7.000000      0.000000     70.000000
50%       21.335560   -157.816800     14.600000      0.020000     73.000000
75%       21.451670   -157.801500     32.900000      0.120000     76.000000
max       21.521300   -157.711390    306.600000     11.530000     87.000000

In [50]:
df.loc[(df['prcp'].isnull()) & (df['name'] == 'WAIKIKI 717.2, HI US') & (df['month'] == '01'), 'prcp']

Series([], Name: prcp, dtype: float64)

In [51]:
df.iloc[4]

station                 USC00519397
name           WAIKIKI 717.2, HI US
latitude                    21.2716
longitude                  -157.817
elevation                         3
prcp                      0.0400858
tobs                             73
month                            01
day                              06
year                           2010
date_format     2010-01-06 00:00:00
Name: 4, dtype: object

In [52]:
df.iloc[26]

station                 USC00519397
name           WAIKIKI 717.2, HI US
latitude                    21.2716
longitude                  -157.817
elevation                         3
prcp                      0.0400858
tobs                             70
month                            01
day                              30
year                           2010
date_format     2010-01-30 00:00:00
Name: 26, dtype: object

In [53]:
df.iloc[341]

station                 USC00519397
name           WAIKIKI 717.2, HI US
latitude                    21.2716
longitude                  -157.817
elevation                         3
prcp                      0.0400858
tobs                             68
month                            01
day                              13
year                           2011
date_format     2011-01-13 00:00:00
Name: 341, dtype: object

In [54]:
df.columns.tolist()

['station',
 'name',
 'latitude',
 'longitude',
 'elevation',
 'prcp',
 'tobs',
 'month',
 'day',
 'year',
 'date_format']

In [55]:
df.head()

,station,name,latitude,longitude,elevation,prcp,tobs,month,day,year,date_format
0,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0,0.080000,65,01,01,2010,2010-01-01
1,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0,0.000000,63,01,02,2010,2010-01-02
2,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0,0.000000,74,01,03,2010,2010-01-03
3,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0,0.000000,76,01,04,2010,2010-01-04
4,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0,0.040086,73,01,06,2010,2010-01-06

In [56]:
df.to_csv('clean_datafile.csv', index=False)

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 19550 entries, 0 to 19549
Data columns (total 11 columns):
station        19550 non-null object
name           19550 non-null object
latitude       19550 non-null float64
longitude      19550 non-null float64
elevation      19550 non-null float64
prcp           19550 non-null float64
tobs           19550 non-null int64
month          19550 non-null object
day            19550 non-null object
year           19550 non-null object
date_format    19550 non-null datetime64[ns]
dtypes: datetime64[ns](1), float64(4), int64(1), object(5)
memory usage: 2.4+ MB